# Game/data/stories.py

STORIES = {
    "story_1": {
        "title": "Пригоди лісу",
        "description": "Захоплива пригода в чарівному лісі, де на вас чекають таємниці та небезпеки. Вам доведеться битися з дикими звірами, знаходити приховані стежки та розгадувати давні загадки, щоб вижити.",
        "start_data_path": "Game/stories/forest_adventure.json" # <-- Оновлено цей шлях
    },
    "story_2": {
        "title": "Таємниці замку",
        "description": "Досліджуйте старий замок, розкривайте його секрети та бийтеся з давнім злом. Кожен куток замку приховує небезпеки та підказки до минулого, яке краще б залишилося забутим.",
        "start_data_path": "Game/stories/castle_secrets.json" # Приклад, поки не створюємо
    },
    "story_3": {
        "title": "Космічна Одіссея",
        "description": "Відправтесь у подорож через безмежний космос. Досліджуйте нові галактики, зустрічайте інопланетні цивілізації та розкрийте таємницю зниклої колонії.",
        "start_data_path": "Game/stories/space_odyssey.json"
    },
    "story_4": {
        "title": "Кіберпанк: Світ тіней",
        "description": "Пориньте у футуристичний світ, де технології змінили все. Пробивайтеся крізь хакерські мережі та корпоративні інтриги у неоновому мегаполісі.",
        "start_data_path": "Game/stories/cyberpunk_shadows.json"
    }
}